In [21]:
import numpy as np
import pandas as pd
import seaborn as sns
from sklearn.preprocessing import MinMaxScaler
%pylab inline
import matplotlib.pyplot as plt
from sklearn.cluster import KMeans
from yellowbrick.cluster.silhouette import SilhouetteVisualizer
from sklearn import metrics
from sklearn.metrics import pairwise_distances, davies_bouldin_score,silhouette_score

Populating the interactive namespace from numpy and matplotlib

In [23]:
titanic=pd.read_csv(r"C:\Users\hpz820\Documents\GitHub\bootcampr\Thoughts_on_clustering\1. Data_preparation\titanic.csv", sep=',')
titanic

,Survived,Pclass,Name,Sex,Age,Siblings/Spouses Aboard,Parents/Children Aboard,Fare
0,0,3,Mr. Owen Harris Braund,male,22.0,1,0,7.2500
1,1,1,Mrs. John Bradley (Florence Briggs Thayer) Cum...,female,38.0,1,0,71.2833
2,1,3,Miss. Laina Heikkinen,female,26.0,0,0,7.9250
3,1,1,Mrs. Jacques Heath (Lily May Peel) Futrelle,female,35.0,1,0,53.1000
4,0,3,Mr. William Henry Allen,male,35.0,0,0,8.0500
...,...,...,...,...,...,...,...,...
882,0,2,Rev. Juozas Montvila,male,27.0,0,0,13.0000
883,1,1,Miss. Margaret Edith Graham,female,19.0,0,0,30.0000
884,0,3,Miss. Catherine Helen Johnston,female,7.0,1,2,23.4500
885,1,1,Mr. Karl Howell Behr,male,26.0,0,0,30.0000
886,0,3,Mr. Patrick Dooley,male,32.0,0,0,7.7500

In [24]:
titanic.describe()

,Survived,Pclass,Age,Siblings/Spouses Aboard,Parents/Children Aboard,Fare
count,887.000000,887.000000,887.000000,887.000000,887.000000,887.00000
mean,0.385569,2.305524,29.471443,0.525366,0.383315,32.30542
std,0.487004,0.836662,14.121908,1.104669,0.807466,49.78204
min,0.000000,1.000000,0.420000,0.000000,0.000000,0.00000
25%,0.000000,2.000000,20.250000,0.000000,0.000000,7.92500
50%,0.000000,3.000000,28.000000,0.000000,0.000000,14.45420
75%,1.000000,3.000000,38.000000,1.000000,0.000000,31.13750
max,1.000000,3.000000,80.000000,8.000000,6.000000,512.32920

In [18]:
titanic = titanic.drop(
        columns=[
            "Name"
        ])

In [19]:
def OHE_df(data):
    titanic_OHE=pd.get_dummies(data, 
        drop_first=False
    )
    return titanic_OHE

In [22]:
titanic_ohe = OHE_df(titanic)

titanic_num_ohe = pd.get_dummies(titanic_ohe, columns=["Pclass"], drop_first=False )

scaler = MinMaxScaler()

titanic_mms = scaler.fit_transform(titanic_num_ohe)